import React from 'react';
// import YoutubePlayer from '../youtubePlayer/YoutubePlayer';
import '../singlePost/singlePost.css';
export default function SinglePost() {
  return (
    <div className="singlePost">
      <div className="singlePostWrapper">
        <h1 className="singlePostTitle">כותרת פוסט</h1>
        <div className="singlePostEditContainer">
          <i className="singlePostIcon fa-solid fa-pen-to-square"></i>
          <i className="singlePostIcon fa-solid fa-trash-can"></i>
        </div>
        <img
          className="singlePostImg"
          src="https://bahrain101-i35ch33zpu3sxik.stackpathdns.com/wp-content/uploads/2017/01/yoga-2.jpg"
          alt=""
        />

        <div className="singlePostInfo">
          <span className="singlePostAuthor">
            ענבל וולפסון <b>InBalance</b>
          </span>
          <span className="singlePostDate">תאריך הפוסט</span>
        </div>
        {/*   <div className="singelPostYoutubePlayer">
          <YoutubePlayer embedId="r5KzX2pufhU" />
        </div> */}

        <p className="singlePostDesc">
          פרוש המילה אשטנגה הוא אשטה=8 אנגה=איבר. על פי היוגה סוטרא של פטנגלי
          קיימים 8 שלבים המביאים את המתרגל היוגי להתפתחות רוחנית. יאמה – ערך
          התנהגותי לפיו צריך לנהוג. הכוונה לערכים אוניברסאליים מוסכמים: האימסה –
          אי אלימות, המנעות מפגיעה במחשבה, דיבור או פעולה בכל יצור חי. סטיה –
          אמירת אמת, כנות. אסטיה – המנעות מחמדנות, מגניבה.ברהמצריה – טוהר בעשיה,
          איפוק מיני.אפאריגרה – אי רכושנות, לא לצבור דברים. ניאמה – משמעת עצמית:
          שאוצה – טוהר הגוף. סנטושה – סיפוק ממה שיש. טאפס – התלהבות.סואדהיאיה –
          לימוד עצמי מכתבים עתיקים קדושים.אישוורה פראנידהאנה – התמסרות לאלקים.
          אסאנה – תנוחות יוגה, תירגול פיזי שנועד לטהר את הגוף והמחשבה‪. אנא =
          גוף אסה =ישיבה, ישיבה בתוך גוף כל שצריך לעשות על מנת שהישיבה בתוך הגוף
          תיהיה אפשרית. פראניאמה – הנעת הנשימה, הגברת חמצן למח שיוצרת תודעה
          בריאה ועירנית. פרטיהארה – התכנסות החושים, ריסון החושים על מנת לימנוע
          הסחת הדעת מכל מה שטפל. דהארנה – ריכוז. דהיינה – מדיטציה, מצב תודעתי
          שמתקבל מתוך תרגול של ששת השלבים הקודמים. סמאדהי – מצב מדיטטיבי שבו
          יכול האדם להיות אחד עם הטבע, החיבור אל הקוסמוס. ששת הסדרות באשטנגה
          יוגה: הסדרה הראשונה – נקראת יוגה ציקיטסה, יוגה תראפיה. סידרה זו היא
          החשובה ביותר מכל הסדרות כיוון שהיא הבסיס לתירגול שאר סדרות. ע"‪"י
          תירגול סידרה זו נבנה יסודות נכונים של זקיפות, שליטה באוג'אי ובאנדות,
          הסדרה הראשונה מתמקדת בכפיפות לפנים הסדרה השניה – נאדי שודהנה, טיהור
          מערכת העצבים מתמקדת בעיקר בכפיפות לאחור, בהקשתות. הסדרות השלישית,
          רביעית, חמישית ושישית הן סדרות מתקדמות נקראות סטירה בהאגה – תירגול
          מתקדם. סדרות אלו משלבות בין גמישות לכח ואליהן ניגשים אחרי תרגול ממושך
          של הסדרות הראשונות, סדרות אלו מצריכות רמה גבוהה של גמישות, ענווה
          וצניעות. מדיטציה: מדיטציה היא לב היוגה, בלי מדיטציה (דהיאנה – השלב
          השביעי באשטנגה) התרגול יהיה טפל וההתקדמות שבו לעיתים איטית יותר
          וסבוכה. בלי היוגה הישיבה למדיטציה יותר קשה ופחות נוחה.
        </p>
      </div>
    </div>
  );
}
